Revit 2027 API
RevitLinkType.IsNestedLink Property
 Indicates whether this link is a nested or top-level link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsNestedLink { get; }
Public ReadOnly Property IsNestedLink As Boolean
	Get
public:
property bool IsNestedLink {
	bool get ();
}
member IsNestedLink : bool with get
Property Value
Boolean
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace